{
  "heading" : {
    "en" : "Teaching" },

  "courses" : [
    { "title" : "MIDS w209 - Information Visualization and Communication",
		"abstract"	 : "Data Science program at UC Berkeley's Information School.",
        "type"   : "Lecturer",
        "date"   : "Spring 2018 - NOW",
		"downloads" : [
			{
				"href"  : "https://www.ischool.berkeley.edu/courses/datasci/209",
				"desc"  : "More"
			}
		]
      },
     { "title" : "COMP 1020 - Introductory Computer Science 2",
		"abstract"	 : "As a sessional instructor/lecturer at the CS department of University of Manitoba, I taught and gave lectures on 
						topics related to advanced JAVA programming. 
						In addition to handling large classes of about 80 students, I worked to improve the course by updating 
						the curriculum and improving the lecture slides and by re-writing student assignment instructions to clarify areas 
						that posed misunderstandings.",
        "type"   : "Instructor",
        "date"   : "Winter 2016",
		"downloads" : [
			{
				"href"  : "https://www.cs.umanitoba.ca/coursedescrip/comp1020.pdf",
				"desc"  : "Syllabus"
			}
		]
      },
	       
	  { "title" : "COMP 3020 -  Human-Computer Interaction 1",
		"abstract"	 : "As a teaching assistant/marker at the CS department of University of Manitoba, I helped the course instructors through 
						various tasks including answering student questions, invigilating exams, and marking projects and assignments.",
        "type"   : "Instructor",
        "date"   : "Fall 2015",
		"downloads" : [
			{
				"href"  : "https://www.cs.umanitoba.ca/coursedescrip/comp3020.pdf",
				"desc"  : "Syllabus"
			}
		]
      },
	       
	  { "title" : "ACS-3909 - ADVANCED INTERNET PROGRAMMING",
		"abstract"	 : "I was invited back in the following term (winter 2010) to teach advance internet programming course at the University of Winnipeg's 
						Applied Computer Science department. This course provided students with a thorough knowledge of server-side web programming. Topics included 
						n-tiered systems, session tracking, interfaces and stereotypes, dynamic web page design, database connections, and XML processing. 
						Students gained considerable knowledge and experience by learning important features needed for e-commerce, applying advanced 
						web application techniques, and utilizing web databases.",
        "type"   : "Instructor",
        "date"   : "Winter 2010",
		"downloads" : [
			{
				"href"  : "http://www.acs.uwinnipeg.ca/undergraduate/undergraduate_courses/undergraduate_courses_outlines",
				"desc"  : "Syllabus"
			}
		]
      },
	       
	  { "title" : "ACS-2909 - INTERNET PROGRAMMING",
		"abstract"	 : "I was hired as a sessional instructor/lecturer at the University of Winnipeg's Applied Computer Science department to teach introductory 
						internet programming concepts in fall 2009. 
						This course provided students with an overview of Internet and Web programming, development tools, resources, utilities, multimedia, 
						and security issues. Students gained hands-on experience in Javascript, Rich Internet Applications (RIAs), Web services, Design Patterns 
						and Mobile Application Development.",
        "type"   : "Instructor",
        "date"   : "Fall 2009",
		"downloads" : [
			{
				"href"  : "http://www.acs.uwinnipeg.ca/undergraduate/undergraduate_courses/undergraduate_courses_outlines",
				"desc"  : "Syllabus"
			}
		]
      }		
	  
	],
}
